/**
 * 通常の広聴AIのScatterChart.tsxのculsterDataのサンプルデータ
 */
const sampleData = [
  {
    "cluster": {
      "level": 1,
      "id": "1_8",
      "label": "経済的困難と支出のバランスに関する懸念",
      "takeaway": "このクラスタは、生活の厳しさや経済的な困難に対する感情、無駄削減の重要性とそのリスク、助成金の打ち切りによる影響に関する意見を集約しています。人々は、生活費の高騰や収入の減少に伴うストレスを感じつつ、無駄を削減することの必要性と、それに伴う必要な支出の存在についての複雑な視点を持っています。また、助成金の打ち切りがもたらす経済的な不安や、無駄遣いに対する社会的な関心の不足についても言及されており、これらの要素が相互に影響し合っていることが示されています。",
      "value": 7,
      "parent": "0",
      "density_rank_percentile": 0.375
    },
    "xValues": [
      6.0785456,
      5.206643,
      5.783053,
      5.5844417,
      5.0314884,
      5.5653915,
      4.9086304
    ],
    "yValues": [
      7.9961405,
      8.330965,
      8.128012,
      8.689482,
      8.42577,
      8.059025,
      8.030002
    ],
    "texts": [
      "<b>経済的困難と支出のバランスに関する懸念</b><br>生活が苦しいと感じている",
      "<b>経済的困難と支出のバランスに関する懸念</b><br>無駄を削ることには必要な支出が含まれていない可能性がある",
      "<b>経済的困難と支出のバランスに関する懸念</b><br>助成金が打ち切られて困っている",
      "<b>経済的困難と支出のバランスに関する懸念</b><br>無駄遣いをしている人について言及しないのは不思議",
      "<b>経済的困難と支出のバランスに関する懸念</b><br>無駄を削ることには必要な支出も含まれているのではないか",
      "<b>経済的困難と支出のバランスに関する懸念</b><br>助成金が打ち切られたことに困っている",
      "<b>経済的困難と支出のバランスに関する懸念</b><br>無駄を削ることには必要な支出も含まれている可能性がある"
    ],
    "centerX": 5.451170514285714,
    "centerY": 8.237056642857143
  },
  {
    "cluster": {
      "level": 1,
      "id": "1_7",
      "label": "地域福祉と経済支援の必要性",
      "takeaway": "このクラスタは、地方のインフラや福祉現場の厳しい状況と、物価上昇に伴う経済的な影響に対する支援の必要性を集約しています。参加者は、限られた予算の中でインフラの維持や福祉サービスの提供が困難になっている現状を訴え、特に物価上昇に対する政府や関連機関からの積極的な支援を求めています。地域住民の生活の質を維持するためには、効果的な支援策や予算の再評価が急務であるとの認識が強まっています。",
      "value": 4,
      "parent": "0",
      "density_rank_percentile": 0.25
    },
    "xValues": [
      5.2818136,
      5.846079,
      5.539803,
      6.275031
    ],
    "yValues": [
      7.5085406,
      6.995723,
      7.502381,
      7.1539164
    ],
    "texts": [
      "<b>地域福祉と経済支援の必要性</b><br>地方のインフラが劣化しており、予算を削る余裕がない",
      "<b>地域福祉と経済支援の必要性</b><br>物価上昇に対して補助金が減少しているため、積極的な支援を望む<br />",
      "<b>地域福祉と経済支援の必要性</b><br>福祉の現場は人手不足と予算不足のダブルパンチで限界に達してい<br />る",
      "<b>地域福祉と経済支援の必要性</b><br>物価が上がる中で補助金が減少しているため、積極的な支援を望む<br />"
    ],
    "centerX": 5.73568165,
    "centerY": 7.29014025
  },
  {
    "cluster": {
      "level": 1,
      "id": "1_2",
      "label": "持続可能な経済成長のための支援と投資",
      "takeaway": "このクラスタは、日本の経済成長を促進するための多様な支援策と投資の重要性に関する意見を集約しています。民間スタートアップの支援や公共事業による地方経済の活性化、さらには社会支出の増加が、持続可能な成長を実現するために不可欠であるとの認識が強調されています。また、韓国の積極的な投資活動が経済成長に寄与している事例を参考にし、日本においても同様のアプローチが求められています。",
      "value": 7,
      "parent": "0",
      "density_rank_percentile": 0.625
    },
    "xValues": [
      6.675296,
      7.492099,
      6.851655,
      7.0907636,
      7.3052516,
      7.473704,
      6.897961
    ],
    "yValues": [
      5.0114074,
      4.8824134,
      5.6576443,
      5.01194,
      5.6252575,
      5.490481,
      6.027149
    ],
    "texts": [
      "<b>持続可能な経済成長のための支援と投資</b><br>民間スタートアップ支援が日本の未来にとって重要である",
      "<b>持続可能な経済成長のための支援と投資</b><br>日本はかつて公共事業によって地方経済を支えた成功例がある",
      "<b>持続可能な経済成長のための支援と投資</b><br>OECD各国と比べて日本の社会支出は低水準であり、もっと投資<br />が必要",
      "<b>持続可能な経済成長のための支援と投資</b><br>日本は公共事業によって地方経済を支えた成功例がある",
      "<b>持続可能な経済成長のための支援と投資</b><br>韓国の積極投資が成長率維持に寄与している",
      "<b>持続可能な経済成長のための支援と投資</b><br>韓国は積極投資で成長率を維持している",
      "<b>持続可能な経済成長のための支援と投資</b><br>日本の社会支出はOECD各国と比べて低水準であり、もっと投資<br />が必要"
    ],
    "centerX": 7.112390028571428,
    "centerY": 5.386613228571428
  },
  {
    "cluster": {
      "level": 1,
      "id": "1_1",
      "label": "持続可能な未来に向けた国家の役割と投資",
      "takeaway": "このクラスタは、持続可能な社会の実現に向けた政府の役割と、未来の技術革新を支えるための国家の投資の重要性に関する意見を集約しています。参加者は、脱炭素社会の構築やITインフラの整備、教育・研究開発への支出が国家の競争力を高め、経済成長を促進するために不可欠であると認識しており、特に政府の積極的な介入と資金投入が求められています。",
      "value": 5,
      "parent": "0",
      "density_rank_percentile": 0.75
    },
    "xValues": [
      6.6157513,
      6.3306746,
      6.197876,
      6.514825,
      5.823603
    ],
    "yValues": [
      6.529118,
      5.499146,
      5.3250394,
      6.112044,
      6.1001267
    ],
    "texts": [
      "<b>持続可能な未来に向けた国家の役割と投資</b><br>脱炭素社会の構築には政府主導の資金投入が不可欠",
      "<b>持続可能な未来に向けた国家の役割と投資</b><br>国は宇宙や量子技術にもっと投資すべき",
      "<b>持続可能な未来に向けた国家の役割と投資</b><br>教育や研究開発への支出は将来への投資である",
      "<b>持続可能な未来に向けた国家の役割と投資</b><br>民間投資が弱い今、政府が需要を創出するのは自然な政策判断であ<br />る",
      "<b>持続可能な未来に向けた国家の役割と投資</b><br>ITインフラ整備は国の競争力に直結する"
    ],
    "centerX": 6.29654598,
    "centerY": 5.91309482
  },
  {
    "cluster": {
      "level": 1,
      "id": "1_5",
      "label": "持続可能な財政運営と透明性の確保",
      "takeaway": "このクラスタは、持続可能な社会を実現するための財政運営における透明性と規律の重要性を強調しています。参加者は、政党の財政方針が不明瞭であることに対する懸念を示しつつ、現場の声を反映した政策形成や中長期的な視点での財政戦略の必要性を訴えています。また、ポピュリズムに流されず、持続可能な経済成長を目指すための冷静な議論が求められています。",
      "value": 9,
      "parent": "0",
      "density_rank_percentile": 0.875
    },
    "xValues": [
      8.256485,
      7.5665665,
      7.574907,
      7.914173,
      7.789412,
      8.147484,
      7.9882936,
      8.4481,
      8.484752
    ],
    "yValues": [
      8.209325,
      7.3031054,
      8.432297,
      7.9823136,
      7.3954105,
      7.5016465,
      8.4933405,
      7.4497366,
      7.946266
    ],
    "texts": [
      "<b>持続可能な財政運営と透明性の確保</b><br>どの政党も財政運営の哲学が曖昧に見える",
      "<b>持続可能な財政運営と透明性の確保</b><br>公平な分配がなければ社会の安定はあり得ない",
      "<b>持続可能な財政運営と透明性の確保</b><br>野党のバラマキ批判は理解できるが、現場の声を聞くべき",
      "<b>持続可能な財政運営と透明性の確保</b><br>収支バランスの議論が必要であり、ポピュリズムに流されてはいけ<br />ない",
      "<b>持続可能な財政運営と透明性の確保</b><br>持続可能な社会のために財政規律を取り戻すべき",
      "<b>持続可能な財政運営と透明性の確保</b><br>10年後に後悔しない財政戦略を立てるべき",
      "<b>持続可能な財政運営と透明性の確保</b><br>財政破綻の話は利権構造を守るための方便ではないか",
      "<b>持続可能な財政運営と透明性の確保</b><br>リーマン後の財政出動はもう少し長く続けるべきだった",
      "<b>持続可能な財政運営と透明性の確保</b><br>与党は中長期的視点で財政を考えるべき"
    ],
    "centerX": 8.018908122222221,
    "centerY": 7.857049011111111
  },
  {
    "cluster": {
      "level": 1,
      "id": "1_4",
      "label": "財政政策とメディアの影響に関する懸念",
      "takeaway": "このクラスタは、財政政策の重要性とその影響、さらにメディアの報道の中立性に対する懸念を集約しています。参加者は、財政改革が日本の信用力維持に不可欠であることや、低インフレ時における財政支出の重要性を強調しつつ、緊縮財政が経済に与えるマイナスの影響や、メディアが財務省の影響を受けている可能性についての疑念を表明しています。過去の教訓を踏まえ、持続可能な経済成長と公正な情報発信の必要性が強調されています。",
      "value": 5,
      "parent": "0",
      "density_rank_percentile": 0.5
    },
    "xValues": [
      8.239659,
      7.459485,
      7.214658,
      7.904001,
      8.264441
    ],
    "yValues": [
      6.809644,
      6.6225314,
      6.8611703,
      6.3884916,
      6.3440595
    ],
    "texts": [
      "<b>財政政策とメディアの影響に関する懸念</b><br>メディアは財務省の影響を受けているのではないかと疑っている",
      "<b>財政政策とメディアの影響に関する懸念</b><br>日本の信用力を維持するためには財政改革が不可欠である",
      "<b>財政政策とメディアの影響に関する懸念</b><br>インフレ率が低い時期には財政支出を活用すべきというのがマクロ<br />経済の定石",
      "<b>財政政策とメディアの影響に関する懸念</b><br>緊縮財政は乗数効果がマイナスになる可能性があるため、注意が必<br />要",
      "<b>財政政策とメディアの影響に関する懸念</b><br>戦前の緊縮が社会不安を招いた教訓を忘れてはいけない"
    ],
    "centerX": 7.816448800000001,
    "centerY": 6.605179359999999
  },
  {
    "cluster": {
      "level": 1,
      "id": "1_3",
      "label": "国際的な財政政策の比較と成功事例",
      "takeaway": "このクラスタは、国際的な財政政策の動向に関する意見を集約し、特に積極財政政策と緊縮政策の成功事例を比較しています。参加者は、イギリスを含む複数の国が積極的な財政政策を採用している一方で、緊縮政策を実施した国々が経済成長を達成した事例を挙げ、日本の経済戦略の独自性や課題を再評価する必要性を感じています。これにより、国際的な経済政策の連携や影響を考慮した議論が進んでいることが示されています。",
      "value": 4,
      "parent": "0",
      "density_rank_percentile": 0.125
    },
    "xValues": [
      8.270153,
      8.261868,
      7.9412045,
      8.029205
    ],
    "yValues": [
      5.1894736,
      5.972134,
      5.3461757,
      5.788366
    ],
    "texts": [
      "<b>国際的な財政政策の比較と成功事例</b><br>イギリスも積極財政に転じており、日本だけが例外ではない",
      "<b>国際的な財政政策の比較と成功事例</b><br>緊縮政策を実施して豊かになった国の例を教えてほしい",
      "<b>国際的な財政政策の比較と成功事例</b><br>イギリスも積極財政に転じたことから、日本だけが例外ではない",
      "<b>国際的な財政政策の比較と成功事例</b><br>緊縮政策を実施して豊かになった国の例を知りたい"
    ],
    "centerX": 8.125607625,
    "centerY": 5.574037325
  },
  {
    "cluster": {
      "level": 1,
      "id": "1_6",
      "label": "社会的公正と次世代への責任",
      "takeaway": "このクラスタは、社会的な不平等や庶民の苦境に対する疑問、次世代への責任感、そして社会的弱者支援の重要性に関する意見を集約しています。参加者は、経済的格差や権力の不均衡がもたらす影響を考察し、より公平な社会を求める声を上げています。また、親としての選択が子どもたちに与える影響を重視し、社会全体が弱者を支える仕組みを求める姿勢が見受けられます。国債に対する偏見の解消も重要なテーマとして取り上げられ、より客観的な視点を持つことの必要性が訴えられています。",
      "value": 5,
      "parent": "0",
      "density_rank_percentile": 1
    },
    "xValues": [
      6.514158,
      6.7933903,
      6.7854924,
      7.162801,
      6.902584
    ],
    "yValues": [
      8.529066,
      7.801255,
      7.2868977,
      8.725812,
      8.600784
    ],
    "texts": [
      "<b>社会的公正と次世代への責任</b><br>庶民ばかりが我慢させられる理由について疑問を持つべき",
      "<b>社会的公正と次世代への責任</b><br>親として次世代に恥ずかしくない選択をしたい",
      "<b>社会的公正と次世代への責任</b><br>社会は弱い人を支える仕組みであるべきであり、財政もその一部で<br />ある",
      "<b>社会的公正と次世代への責任</b><br>国債を敵視するのは洗脳だと思う",
      "<b>社会的公正と次世代への責任</b><br>国債を敵視するのは洗脳である"
    ],
    "centerX": 6.831685139999999,
    "centerY": 8.18876294
  }
];

type SampleDataType = {
    cluster: {
        level: number;
        id: string;
        label: string;
        takeaway: string;
        value: number;
        parent: string;
        density_rank_percentile: number;
    };
    xValues: number[];
    yValues: number[];
    texts: string[];
    centerX: number;
    centerY: number;
}

type EmbeddingType= {
    x: number;
    y: number;
    clusters: Array<string | number>;
}

function generateSampleEmbeddings(sampleData: SampleDataType[]): EmbeddingType[] {
    return sampleData.map((data) => {
        return {
            x: data.xValues[0],
            y: data.yValues[0],
            clusters: data.texts
        };
    });
}

export const sampleEmbeddings = generateSampleEmbeddings(sampleData);
